Import relevant libraries

In [23]:
import numpy as np
import pandas as pd

Load dataset

In [24]:
marketing_data = pd.read_csv("marketing_campaign.csv")

Subset for relevant columns

In [25]:
marketing_data = marketing_data[['ID', 'Year_Birth','Marital_Status','Income']]

Inspect first 5 rows and data types of the dataset

In [26]:
marketing_data.head()

     ID  Year_Birth Marital_Status   Income
0  5524        1957         Single  58138.0
1  2174        1954         Single  46344.0
2  4141        1965       Together  71613.0
3  6182        1984       Together  26646.0
4  5324        1981        Married  58293.0

In [27]:
marketing_data.shape

(2240, 4)

Fill NAs in the income column using fillna

In [32]:
marketing_data['Income'] = marketing_data['Income'].fillna(0)

Change the data type of the Income from float to int

In [29]:
marketing_data['Income_changed'] = marketing_data['Income'].astype(int)

In [30]:
marketing_data[['Income','Income_changed']].head()

    Income  Income_changed
0  58138.0           58138
1  46344.0           46344
2  71613.0           71613
3  26646.0           26646
4  58293.0           58293